# 1) შემოაყვანინე მომხმარებელს სიტყვა
word = input("შეიყვანე სიტყვა ან ტექსტი: ")


if 'a' in word or 'A' in word:
    print("ტექსტში არის ასო 'a' ან 'A'")
else:
    print("ტექსტში არ არის ასო 'a' და 'A'")


if 'car' not in word:
    print("ტექსტში არ არის სიტყვა 'car'")
else:
    print("ტექსტში არის სიტყვა 'car'")
#2) მომხმარებელს შემოატანინეთ ტექსტი.
#-> დაუარეთ ამ ტექტის ასოებს for ლუპით
#-> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო

#მაგალითა: შემოიყვანა 'bananA'
#უნდა დაიპრინტოს: 
#b,n,n
#2) მომხმარებელს შემოატანინეთ ტექსტი.

text = input("შეიყვანე ტექსტი: ")

for letter in text:

    if letter == 'a' or letter == 'A':
        continue
    else:
     print(letter, end="")

