#__________________________________________________________________________________________________________
# მომხმარებლისგან ტექსტის მიღება
text = input("შეიყვანე სიტყვა ან ტექსტი: ")

# ტექსტის სიგრძის გამოთვლა
length = len(text)
print("ტექსტის სიგრძე არის:", length)

# for ციკლი range()-ით
print("ტექსტის თითოეული ასო:")
for i in range(length):
    print(text[i])

#___________________________________________________________________________________________________________
    # ვქმნით სიას სტრინგებით
words = ["ლუკა", "საბა", "მარიამი", "ნიკა", "გიორგი"]

# დავუაროთ თითოეულ ელემენტს
for word in words:
    print("სიტყვა:", word)
    length = len(word)
    print("სიგრძე:", length)
    
    # ვამოწმებთ ლუწია თუ კენტი
    if length % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")

