# #1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი
# #str სტრინგ ტიის მონაცემი მაგ:"ნიკა"
# #int ინტეჯერ ტიპის მონაცემი მაგ:5
# # bool ბულეან ტიპის მონაცემი მაგ:1,7
# # float ფლოათ ტიპის მონაცემი მაგ: true ,false

# #2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი
# print("nika")
# print(5)
# print(1.4)
# print(True)

# #3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)
# user_name="nika"
# first_num=5
# first_bool=1.3
# first_float=True
# print(user_name, first_num,first_bool,first_float)
# #4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ
# num1=(10)
# num2=(20)
# print(num1+num2)
# print(num1-num2)
# print(num1*num2)
# print(num1/num2)
# #5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგებიდ და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)
# name="maia"
# name2="tikio"
# print(name+name2) #კონკატინაცია
# #---------------------------------------------------------
# #6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // , **

# #7)მომხმარებელს შემოატანინე ორი რიცხვიდ და მოახდინე აბსოლიტურად ყველა ამთემატიკური მოქმედება ამ ორ რიცხვზე --> + - * / // ** %

# y=int(input("enter first_num"))
# x=int(input("enter second_num"))


# print(x//y)
# print(x**y)
# print(x%y)
# #Bouns
# # ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

# #      15 / 3 = 5
# #      20 / 4 = 5
# #      

# #      15 // 10 = 1
# #      10 // 7 =1
# #      

# #      4 * 3 = 12
# #      40 * 3 = 120
# #      120 * 3 = 360

# #      4 ** 3 = 64
# #      10 ** 3 = 1000
# #     

# #      10 % 7 =3
# #      3 % 2 = 1


# #8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე

# #9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული ელემენტის ტიპს
# num1=10
# num2="nika"
# num3=1.3
# num4=True
# print(type(num1))
# print(type(num2))
# print(type(num3))
# print(type(num4))
# #---------------------------------------------------------------------------------------------------
# #10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ),
# num1=int(input("first_num"))
# num2=int(input("sec_num"))
# print(num1>num2)
# print(num1<num3)
# print(num1==num2)
# print(num1>=num2)
# print(num1<=num2)
# #11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 



# #12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
# #                                
# # True and True -- true    |   True or True -- ...   true        
# # True and False -- false     |   True or False -- ... true
# # False and True -- false     |   False or True -- ...true
# # False and False --false  |   False or False -- ... false

# #13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
# #  5 == 10 and 10 <= 10 -- false...  |   True or "giorgi" == "giorgi" -- ...  true         
# # True and False -- ...  false      |   10 < 2 or "lasha" == "beqa" -- ...false
# # 10 > 3 and 5 == 3 -- ... false    |   2 >= 3 or 40 < 2 -- ...true
# # True and 200 <= 200 -- ...  true  |   4 == 3 or 50 > 300 -- ... false


# #14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop
# for i in range(5,200):
#      print(i)

# #15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop
# for i in range(100,150,5):
#      print(i)
# #---------------------------------------------------------------------------------------
# ##16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop


# for i in range(0,10):
#      print("nika")
     

# #17)ტერმინალში გამოიტანეთ თქვენი რიცხვები 10 იდან 50 მდე while loop


# #18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop
# while(50,150,10):
# #19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop


# # Lists

# #20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 

# #--------------------------------------------------------------------------------------------
# #21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი დაwhile loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 


# # # #22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების გამოყენებით
# # num7=["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]
# # print(num7[3])
# # print(num7[-4])

# # #23)შექმენი ცვლადი სადაც შეინახავ სტრინგს -->ჰიდროელექტროსადგური , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში
# # str="ჰიდროელექტროსადგური"
# # print(str[3])
# # print(str[8])
# #24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"
# num1=int(input("first_num"))
# if num1>0:
#     print("more than 0")
# elif num1<0:
#     print("less than 0")
# else:
#     print("equal 0")
#-----------------------------------------------------------------------------------------
#26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
pas=("nika")
# მომხმარებელს შემოატანინე პაროლი
pas1=input("enter youre password")
# სანამ პირობა არის ჭეშმარიტი(True)
while True:
    if pas==pas1:
        print("gamoicani")
        break
    else :
        pas1=input("enter youre password")
        
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

#27)შექმენი ცვლადი და შეინახე სტრინგი --> C, შენი დავალებაა რომ ტერმინალში გამოიტანო სადგური ,გამოიყენე slicing, ასევე კიდევ გამოიტანე ელექტროსადგური აქაც გამოიყენე სლაისინგი

#28)შექმენი ცვლადი და შეინახე სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"] , შენი დავალებაა რომ ტერმინალში გამოიტანო ყველა სახელი საბადან სანიმდე,ასევე გამოიტანე სახელები გოგადან ირმა მდე გამოიყენე Slicing

#29)შექმენი სია სადაც შეინახავთ ინტეჯერებს,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი მენულე ინდეწსზე მდგომი ელემენტი მეტია სიაში მყოფ ბოლო ინდექსზე მდგომ ელემენტზე და(and) ასევე სიის პირველი ელემენტი მეტია 0 ზე დაუპრინტე --> good , თუ სიის პირველი ელემენტი მეტია სიის ბოლო ელემენტზე და(and) სიის ნოლო ელემენტი ნაკლებია 0 ზე დაუპრინტე --> bad , სხვა შემთხვევაში დაუპრინტე -->"get out"

#30)შმომხმარებელს შემოატანინე ათწილადი,შემდეგ შეადარე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი და 30 ზე ნაკლები მაინ დაუპრინტე -->You entered number between 10 and 30, თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე ნაკლები და 0 ზე მეტი მაშნ დაუპრინტე --> You choose number between 0 and 10 , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები მაშინ დაუპრინტე you choose negative number , სხვა შემთხვევაში დაუპრინტე -->you choose zero(0)
#31)შექმენი სია სადაც შეინახავ სტრინგებს(ადამიანის სახელებს,რაც გინდათ და რამდენიც გინდათ),შემდეგ შეადარეთ თუ ამ სიაში მყოფი მე0 ინდექსზე მდგომი ელემენტი არის 'luka' ან(or) არის "saba" დაუპრინტე -->You choose luka or saba, თუ ამ სიაში მყოფი ბოლო ინდექსზე მყოფი ელემენტი არის "irma" ან(or) "iamze" მაშინ დაუპრინტე --> You choose irma or iamze,სხვა შემთხვევაში დაუპტინტე --> You choose other name