# 1) შექმენით სია საცად მოათავსებტ 7 ადამიანის სახელს,თქვენი დავალებაა რომ ტერმინალში გამოიტანოთ ყველა ელემენტი ცალ ცალკე მინუს ინდექსებით

# სახელები
names =["nika" , "niku" , "nike" , "naka", "nuke" , "lika", "taso"]

# ბეჭდვა
print(names[-1])
print(names[-2])
print(names[-3])
print(names[-4])
print(names[-5])
print(names[-6])
print(names[-7])


# 2) შექმენით 5 ცვლადი და შეინახეთეთ მათში სახელები,თქვენი დავალებაა რომ შეადგინოთ სია ამ ცვლადების გამოყენებით(გამოიყენეთ რათქმაუნდა ცვლადის სახელები),სიის შექმნის შემდეგ გამოიტანეთ ტერმინალში სიაში მყოფი ბოლო ელემენტი(გამოიყენეთ მინუს ინდექსები)

# 5 ცვლადი
name1 = "nika"
name2 = "niku"
name3 = "nike"
name4 = "naka"
name5 = "nuke"

# სიის შექმნა ცვლადებით
names = [name1, name2, name3, name4, name5]

# ბოლო ელემენტის გამოყვანა (მინუს ინდექსით)
print(names[-1])