
#1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
#--> გამოიტანეთ პირველი 5 ელემენტი
#--> გამოიტანეთ ბოლო 3 ელემენტი
#--> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით

# 1)
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

#___________________
print(my_list[:5])

#___________________
print(my_list[-3:])

#___________________
print(my_list[3:8])


# 2)

#______________________
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

#______________________
print(my_list[:-9])  



#2)2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
#--> გამოიტანეთ პირველი 6 ელემენტი
#--> გამოიტანეთ ბოლო 10 ელემენტი
#--> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

numbers=[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 200, 300, 400, 500, 600]
print(numbers[-15:-9])
print(numbers[-10:])
print(numbers[-8:-1])

#3)
name1="tvitmprinavi"
print(name1[8:])

#4)მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
#--> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით
name2='Programmer'
print(name2[0:3])
print(name2[-10:-7])

#5)შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
#--> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
#--> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)
week=["orshabati", "samshabati", "otxshabati", "xutshabati", "paraskevi",  "shabati", "kvira"]
print(week[:5])
print(week[-7:-2])

#2)_-
print(week[5:])
print(week[-2:])


#6)6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
#გამოიტანეთ: 
#'Python'
#'slicing'
#'powerful'
#გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები
true='Python slicing is very powerful'
print(true[:6])
print(true[6:14])
print(true[23:])

print(true[:-24])
print(true[-14:-21])

















